[{ "_id": "5caa2ae4d79ff8157ebd62a9", "title": "JUMP FORCE", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/816020/header.jpg?t=1553188281", "desc": "The most famous Manga heroes are thrown into a whole new battleground: our world. Uniting to fight the most dangerous threat, the Jump Force will bear the fate of the entire humankind.\n\nCreate your own avatar and jump into an original Story Mode to fight alongside the most powerful Manga heroes from DRAGON BALL Z, ONE PIECE, NARUTO, BLEACH, HUNTER X HUNTER, YU-GI-OH!, YU YU HAKUSHO, SAINT SEIYA and many others.\n\nOr head to the Online Lobby to challenge other players and discover lots of modes and activities.\n", "id": 210, "userID": "547230271599280139", "username": "ZENZO Arcade", "priceUSD": 47.5, "price": 2030.01, "version": 1, "private": null, "views": 170 }, { "_id": "5ca94b57c64f2c5bdb9350fa", "title": "ACE COMBAT 7: SKIES UNKNOWN ", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/502500/header.jpg?t=1551741680", "desc": "Become an ace pilot and soar through photorealistic skies with full 360 degree movement; down enemy aircraft and experience the thrill of engaging in realistic sorties! Aerial combat has never looked or felt better!\nProject Aces aims to revolutionize the sky with this entry in the series, offering an experience so immersive it feels like you're piloting an actual aircraft! Weather and the environment affect your aircraft and the HUD, adding a sense of extreme realism never felt before in a flight combat game. Epic dogfights await!", "id": 197, "userID": "547230271599280139", "username": "ZENZO Arcade", "priceUSD": 50, "price": 2136.86, "version": 1, "private": null, "views": 138 }, { "_id": "5ca94960c64f2c5bdb9350f8", "title": "Battlefield V Deluxe Edition", "platform": "XBOX One", "image": "https://http2.mlstatic.com/battlefield-v-deluxe-edi-ps4-nuevo-sellado-original-fisico-D_NQ_NP_896047-MCO28789976997_112018-F.jpg", "desc": "In the spring of 1942, convicted bank robber William Sidney \"Billy\" Bridger, the son of another infamous bank robber, Arthur Bridger, volunteers to join the British military in order to avoid jail time, and is assigned as a demolitions expert to a Special Boat Service team led by George Mason (Craig Fairbrass). Billy and Mason infiltrate occupied North Africa in order to sabotage German airfields. However, things don't go as planned at the first airfield; one of Billy's bombs (\"safecracker specials\") fails to detonate, much to Mason's anger, forcing Billy to commandeer an anti-aircraft gun to destroy the final plane. After an argument with Mason about whose fault it was that Mason could have been killed, Billy and Mason steal a German's car and drive to the second airfield. However, due to Mason's wounds, Billy is forced to infiltrate the airfield alone. Billy is able to destroy the objectives, but detours to a nearby bunker to collect medical supplies for Mason, and uses the radio there to call the HMS Sussex for evacuation. After destroying the base's radar stations, Billy returns to report to Mason. However, Mason is furious when he finds out Billy radioed for help, since it would alert the Germans to their exact location. A massive German force begins to pursue them and they are forced to hide in some ruins. Billy begins to express doubts at his own competence and their chances of survival, as well as grieving over his failure to please his father. Mason confides in Billy that he picked him to volunteer for the unit because his many attempts to rob banks, especially three of one bank, showed him as a \"tryer\", a person who doesn't easily give up. Inspired, Billy fights alongside Mason in a last stand. They manage to hold off the German forces long enough for British reinforcements to arrive, and the Germans are subsequently routed. In the aftermath, Billy and Mason have a newfound respect for each other as they head off for their next mission.", "id": 195, "userID": "547230271599280139", "username": "ZENZO Arcade", "priceUSD": 31, "price": 1324.85, "version": 1, "private": null, "views": 108 }, { "_id": "5c57468b98886e15105c220d", "title": "Table Top Racing: World Tour", "image": "https://movietvtechgeeks.com/wp-content/uploads/2017/04/table-top-racing-world-tour-images-800x450.jpg", "desc": "PINT-SIZED POWERED UP RACING!!!   Get behind the wheelS of 16 ultra-cool, fully tuneable, miniaturised Race Cars and master all 32 devious table top race tracks! ​ Get online with with friends and foes for an 8 player multi-player battle of wits, skill and raw racing talent. Enjoy that moment when you hit an opponent with the Frostbite weapon, just before the final bend and watch them slide off the table to oblivion as you take the cheqeured flag! ​ Also includes an extensive 30 hour  single player game with a full 'Championship Mode' and a multitude of 'Special Event' and 'Drift' Challenge modes.   Crush your enemies using a cominbation of cunning Power-ups and unique Wheel Weapons and blast your way to victory!", "id": 2, "userID": "488377416163786753", "username": "JSKitty | Zenzo.io", "price": "500", "private": null, "platform": "Steam", "views": 107 }, { "_id": "5ca94ae3c64f2c5bdb9350f9", "title": "Fallout 76", "platform": "XBOX One", "image": "https://cdn.gamerant.com/wp-content/uploads/fallout-76-patch-48-gb-helmet-logo.jpg.optimal.jpg", "desc": "Twenty-five years after the Great War, Vault 76 is opened up and its residents given the task of repopulating the wasteland. Shortly after they emerge from the Vault, the player character is contacted by the Vault Overseer. She reveals that Vault 76 was given a secret mandate to secure an arsenal of nuclear weapons deployed throughout Appalachia. The player character is directed to contact the First Responders, a faction of emergency services personnel who tried to aid the residents of Appalachia during the war; however, they discover that the First Responders evacuated after they came under attack from the Scorched. Further investigation reveals that the Scorched are ghouls infected by the breath of a Scorchbeast, a creature that was awoken after the Great War.\n\nAs the Scorched represent a threat to the wasteland beyond Appalachia, the player character decides to secure a nuclear weapon and use it to destroy a Scorchbeast nest. In order to achieve this, they start searching the bunkers of survivalists calling themselves the Free States who were working on the means to detect the Scorched until the Scorched overran them. The player character is able to build a radar system that detects the viral signature of the Scorched, but its limited range makes it ineffective. They hack into a government network and draw the attention of the Enclave, the remnants of the United States government. The Enclave are led by MODUS, a centralised artificial intelligence system. MODUS asks the player character to help connect them to a series of isolated computer networks across Appalachia, and in return offers to connect to the radar system to detect Scorched across the region.\n\nOnce MODUS is connected, they are quickly able to identify the Scorchbeast nest. The player character is directed to a nuclear weapons silo and they launch a missile at the nest. Venturing into the irradiated area, they uncover a laboratory at the centre of the nest, implying that the Scorchbeasts were man-made. The explosion awakens a Scorchbeast Queen, and the player is forced to fight her. With the Queen defeated, the Scorchbeasts' hive mind is broken, and the threat to the wasteland beyond Appalachia is halted. The player character rejoins the other residents of Vault 76 in rebuilding the wasteland.", "id": 196, "userID": "547230271599280139", "username": "ZENZO Arcade", "priceUSD": 35, "price": 1495.8, "version": 1, "private": null, "views": 99 }, { "_id": "5ca3a82c8435c539992187c5", "title": "Kerbal Space Program", "platform": "Steam", "image": "https://www.capsulecomputers.com.au/wp-content/uploads/2014/12/kerbal-space-program-logo-01.jpg", "desc": "In KSP, you have to create a spaceship which will be able to safely take your crew into the space. At your disposal is a collection of parts, which must be assembled to create a functional ship. Each part has a huge influence on the ship itself. It might help it fly high in the sky or drag it down to the ground. What do you think? Are you ready to take some Rocket Science? Believe us though, that it only sounds easy. However, the task is complex and even the smallest mistake might kill your cute group.\n\nThough we know that you are an intelligent person and you are going to handle this. However, building your spacecraft is not the only thing you have to do. Kerbal Space Program gameplay requires you to manage your crew. You need to hire team members, train them and then send them into space. The game also has a strong element of exploration where you discover new planets, moons and star systems. There are so many things you can do.", "id": 134, "userID": "488377416163786753", "username": "JSKitty", "priceUSD": 15, "price": 641.06, "version": 1, "private": null, "views": 82 }, { "_id": "5ca9475ec64f2c5bdb9350f6", "title": "Just Cause 4", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/517630/header.jpg?t=1551383056", "desc": "Rogue agent Rico Rodriguez journeys to Solis, a huge South American world home of conflict, oppression and extreme weather conditions. Strap into your wingsuit, equip your fully customizable grappling hook, and get ready to bring the thunder!", "id": 193, "userID": "547230271599280139", "username": "ZENZO Arcade", "priceUSD": 30, "price": 1282.11, "version": 1, "private": null, "views": 55 }, { "_id": "5caa2bdad79ff8157ebd62aa", "title": "ARK: Survival Evolved", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/346110/header.jpg?t=1551899546", "desc": "Stranded on the shores of a mysterious island, you must learn to survive. Use your cunning to kill or tame the primeval creatures roaming the land, and encounter other players to survive, dominate... and escape!", "id": 211, "userID": "547230271599280139", "username": "ZENZO Arcade", "priceUSD": 19, "price": 812.01, "version": 1, "private": null, "views": 45 }, { "_id": "5ca7d1cfc64f2c5bdb9350da", "title": "Tropico 4", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/57690/header.jpg?t=1535973552", "desc": "The world is changing and Tropico is moving with the times - geographical powers rise and fall and the world market is dominated by new players with new demands and offers - and you, as El Presidente, face a whole new set of challenges.", "id": 165, "userID": "547230271599280139", "username": "ZENZO Arcade", "priceUSD": 7, "price": 299.16, "version": 1, "private": null, "views": 40 }, { "_id": "5ca91a65c64f2c5bdb9350f5", "title": "Ubisoft 20% Discount Code", "platform": "Ubisoft", "image": "https://ubistatic-a.akamaihd.net/0123/PROD/static/images/share-image.jpg?ts=2019-04-01T13:11:22.964Z", "desc": "20% discount from a purchase from the Ubisoft Store\nMore info about the promotion can be found here: https://welcome.club.ubisoft.com/en-GB/discount/", "id": 192, "userID": "354544543850430465", "username": "RivAngE", "priceUSD": 3.5, "price": 149.58, "version": 1, "private": null, "views": 40 }, { "_id": "5c5c13741d71b37989e96b50", "title": "Call of Duty: Modern Warfare 2", "platform": "Steam", "image": "https://i.imgur.com/VfNeBKf.png", "desc": "Call of Duty: Modern Warfare 2 is a first-person shooter video game developed by Infinity Ward and published by Activision. ... An expansive multiplayer mode is featured in the game, with several new features and modes that were not seen in its predecessor.", "id": 36, "userID": "378520729601179648", "username": "YuurinBee | Zenzo.io", "price": "1250", "private": null, "views": 36 }, { "_id": "5ca3ab1e8435c539992187c6", "title": "Call of Duty®: Ghosts", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/209160/header.jpg?t=1447355542", "desc": "Outnumbered and outgunned, but not outmatched.\n\nCall of Duty®: Ghosts is an extraordinary step forward for one of the largest entertainment franchises of all-time. This new chapter in the Call of Duty® franchise features a new dynamic where players are on the side of a crippled nation fighting not for freedom, or liberty, but simply to survive.\n\nFueling this all new Call of Duty experience, the franchise's new next-gen engine delivers stunning levels of immersion and performance, all while maintaining the speed and fluidity of 60 frames-per-second across all platforms.", "id": 135, "userID": "488377416163786753", "username": "JSKitty", "priceUSD": 20, "price": 854.74, "version": 1, "private": null, "views": 35 }, { "_id": "5ca3e427318ab2572b138a1b", "title": "Deus Ex: Mankind Divided ", "platform": "XBOX ", "image": "https://steamcdn-a.akamaihd.net/steam/apps/337000/header.jpg?t=1513077042", "desc": "Now an experienced covert operative, Adam Jensen is forced to operate in a world that has grown to despise his kind. Armed with a new arsenal of state-of-the-art weapons and augmentations, he must choose the right approach, along with who to trust, in order to unravel a vast worldwide conspiracy.", "id": 136, "userID": "352112223084347393", "username": "Tendo | Zenzo.io", "priceUSD": 15, "price": 641.06, "version": 1, "private": null, "views": 35 }, { "_id": "5ca98515c64f2c5bdb935103", "title": "RESIDENT EVIL 2 / BIOHAZARD RE:2 ", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/883710/header.jpg?t=1553562324", "desc": "A deadly virus engulfs the residents of Raccoon City in September of 1998, plunging the city into chaos as flesh eating zombies roam the streets for survivors. An unparalleled adrenaline rush, gripping storyline, and unimaginable horrors await you. Witness the return of Resident Evil 2.", "id": 206, "userID": "547230271599280139", "username": "ZENZO Arcade", "priceUSD": 47.5, "price": 2030.01, "version": 1, "private": null, "views": 34 }, { "_id": "5ca4be3bc64f2c5bdb9350bf", "title": "Star Wars Battlefront 2 (2017)", "platform": "XBOX", "image": "https://media.contentapi.ea.com/content/dam/walrus/en-us/migrated-images/2017/04/news-keyart-clean-wide-flat-16x9-web.jpg.adapt.crop191x100.628p.jpg", "desc": "Star Wars Battlefront II is an action shooter video game based on the Star Wars film franchise. It is the fourth major installment of the Star Wars: Battlefront series and seventh overall, and a sequel to the 2015 reboot of the series.", "id": 139, "userID": "547230271599280139", "username": "ZENZO Arcade", "priceUSD": 20, "price": 854.74, "version": 1, "private": null, "views": 27 }, { "_id": "5ca4dc61c64f2c5bdb9350ca", "title": "Assassin's Creed IV: Black Flag", "platform": "Xbox One", "image": "https://i.ytimg.com/vi/aexhs3Jl9i8/maxresdefault_live.jpg", "desc": "It is the year 1715. Pirates rule the Caribbean and have established their own lawless Republic where corruption, greediness, and cruelty are commonplace. Among these outlaws is a brash young captain named Edward Kenway. His fight for glory has earned him the respect of legends like Blackbeard but also drawn him into the ancient war between Assassins and Templars, a war that may destroy everything the pirates have built. ", "id": 150, "userID": "547230271599280139", "username": "ZENZO Arcade", "priceUSD": 14, "price": 598.32, "version": 1, "private": null, "views": 26 }, { "_id": "5ca7d780c64f2c5bdb9350dc", "title": "Bastion", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/107100/header.jpg?t=1553807612", "desc": "Bastion is an action role-playing experience that redefines storytelling in games, with a reactive narrator who marks your every move. Explore more than 40 lush hand-painted environments as you discover the secrets of the Calamity, a surreal catastrophe that shattered the world to pieces. Wield a huge arsenal of upgradeable weapons and battle savage beasts adapted to their new habitat. Finish the main story to unlock the New Game Plus mode and continue your journey!", "id": 167, "userID": "547230271599280139", "username": "ZENZO Arcade", "priceUSD": 10, "price": 427.37, "version": 1, "private": null, "views": 25 }, { "_id": "5ceeb04fced96e53cae2cff4", "title": "Battlefield 1", "platform": "XBOX One", "image": "https://media.contentapi.ea.com/content/bf/en-us/games/battlefield-1/_global_/_jcr_content/ccm/componentwrapper_0/components/opengraph/ogImage.img.jpg", "desc": "EA DICE returns with the latest iteration of their long-running Battlefield series, and the first game of the core series since 2013's BF 4.Battlefield 1 takes the players to the hectic battlefields of the First World War, from scorching, rocky deserts to mountains and coastal villages you will fight to reshape the landscape of the world with your victories and explosives.Fight on the fronts of WW1, ride period vehicles or mount a horse, pick up your weapon and set out to relive a hundred-years-old history as a soldier of one of the six core factions split between two sides of the massive conflict. This content was copied from https://www.g2a.com/en-us/battlefield-1-origin-key-global-i10000016618004. It is protected by copyright, all rights reserved. If you want to use it, you are obligated to leave the link to the original source.", "id": 327, "userID": "547230271599280139", "username": "ZENZO Arcade", "priceUSD": 8.5, "price": 363.27, "version": 1, "private": null, "views": 21 }, { "_id": "5ccb450a0e90f95b56bf3918", "title": "Genital Jousting", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/469820/header.jpg", "desc": "Genital Jousting tells the story of \"John\", a penis who needs to find a date for his high school reunion. Genital Jousting is also an online and local multiplayer party game about flaccid penises and wiggly anuses for up to eight players at once.", "id": 317, "userID": "266291635715964948", "username": "Josep - CoinDreams.io", "priceUSD": 6, "price": 256.42, "version": 1, "private": null, "views": 18 }, { "_id": "5c6afae834ab2d31a232978e", "title": "Halo 4: Corbulo Emblem DLC", "platform": "xbox", "image": "https://cdns.kinguin.net/media/catalog/category/cache/1/image/173x120/17f82f742ffe127f42dca9de82fb58b1/halo4.jpg", "desc": "XBOX 360/XBOX LIVE GLOBAL Key. Halo 4: Corbulo Emblem DLC. \n\nDownload the Corbulo Emblem to proudly display on your in-game avatar.\n\nNote: The Corbulo Emblem download code works only on Xbox 360, not Xbox One.", "id": 88, "userID": "514223528443248651", "username": "Cryptonite", "price": "80", "private": null, "views": 16 }, { "_id": "5ca7d3a6c64f2c5bdb9350db", "title": "Shadow Tactics: Blades of the Shogun ", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/418240/header.jpg?t=1547119068", "desc": "Shadow Tactics is a hardcore tactical stealth game set in Japan around the Edo period. A new Shogun seizes power over Japan and enforces nationwide peace. In his battle against conspiracy and rebellion, he recruits five specialists with extraordinary skills for assassination, sabotage and espionage.", "id": 166, "userID": "547230271599280139", "username": "ZENZO Arcade", "priceUSD": 10, "price": 427.37, "version": 1, "private": null, "views": 15 }, { "_id": "5ca4d692c64f2c5bdb9350c6", "title": "Agent Awesome", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/345220/header.jpg?t=1458319902", "desc": "Agent Awesome is a humorous strategy game in which you will have to help Agent A plan the perfect strategy to take down E.V.I.L., all of this in order to win a drunk dare. Awesome, right?", "id": 146, "userID": "547230271599280139", "username": "ZENZO Arcade", "priceUSD": 1, "price": 42.74, "version": 1, "private": null, "views": 14 }, { "_id": "5ca94f55c64f2c5bdb9350fc", "title": "FIFA 19 Football", "platform": "XBOX One", "image": "https://wallpapersflood.com/wp-content/uploads/cristiano_ronaldo_fifa_19_game-320x240.jpg", "desc": "FIFA 19 introduces the UEFA Champions League, UEFA Europa League, and UEFA Super Cup competitions to the game after their licenses with Konami's Pro Evolution Soccer expired. The game will have support for promotion and relegation between the Champions League and Europa League. Martin Tyler and Alan Smith return as regular commentators with Derek Rae and Lee Dixon as Champions League commentators. Geoff Shreeves also returns as the touchline reporter as well as Alan McInally providing updates from around the league. New graphics and stadiums have been implemented.", "id": 199, "userID": "547230271599280139", "username": "ZENZO Arcade", "priceUSD": 33, "price": 1410.33, "version": 1, "private": null, "views": 13 }, { "_id": "5c6c44b11a618c6bdc5e0db2", "title": "ONE MORE LINE", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/356890/header.jpg?t=1447370925", "desc": "ONE MORE LINE is a highly addictive, one button, space disco, skill timing game! Steam edition features 2-4 player local multi-player and no advertising. All for a very low price! Can you put a price on fun though?", "id": 89, "userID": "488377416163786753", "username": "JSKitty | PIVX.org", "price": "125", "private": null, "views": 12 }, { "_id": "5ca980e9c64f2c5bdb935102", "title": "METAL GEAR SOLID V: The Phantom Pain", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/287700/header.jpg?t=1535525516", "desc": "Nine years after the events of MGSV: GROUND ZEROES and the fall of Mother Base, Snake a.k.a. Big Boss, awakens from a nine year coma. The year is 1984. The Cold War serves as the backdrop as nuclear weapons continue to shape a global crisis. Driven by revenge, Snake establishes a new private army and returns to the battlefield in pursuit of the shadow group, XOF.\n\nThe METAL GEAR SOLID team continues to ambitiously explore mature themes such as the psychology of warfare and the atrocities that result from those that engage in its vicious cycle. One of the most anticipated games of the year with its open-world design, photorealistic visual fidelity and feature-rich game design, MGSV: The Phantom Pain will leave its mark as one of the hallmarks in the gaming industry for its cinematic storytelling, heavy themes, and immersive tactical gameplay.", "id": 205, "userID": "547230271599280139", "username": "ZENZO Arcade", "priceUSD": 12, "price": 512.85, "version": 1, "private": null, "views": 12 }, { "_id": "5cb353823d55e26c2c40649e", "title": "Demon King Domination: Deluxe Edition", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/921530/header.jpg", "desc": "Become the Demon King! Defeat the warrior princess and claim her body in an erotic RPG visual novel!", "id": 258, "userID": "266291635715964948", "username": "Josep - CoinDreams.io", "priceUSD": 4.5, "price": 192.32, "version": 1, "private": null, "views": 12 }, { "_id": "5c6db4e25d703536f49c1f79", "title": "Worms: Armageddon", "platform": "Steam", "image": "https://images-na.ssl-images-amazon.com/images/I/61L4tCNEA1L.jpg", "desc": "Those intrepid invertebrates return with a vengeance in the much-loved Worms Armageddon. It’s a whole new can of worms! It’s hilarious fun that you can enjoy on your own or with all your friends.", "id": 90, "userID": "274170668545736704", "username": "Bouli | Zenzo.io", "price": "450", "private": null, "views": 11 }, { "_id": "5cabd4e2213eda507565d4a0", "title": "Hard Reset Redux", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/407810/header.jpg", "desc": "Hard Reset Redux is an action-packed and hardcore single-player shooter which embraces the best qualities that the genre has it offer. It includes over-the-top destruction, loads of enemies, great weapon variety, a challenging campaign and a beautifully realized cyberpunk setting.", "id": 228, "userID": "266291635715964948", "username": "Josep - CoinDreams.io", "priceUSD": 10, "price": 427.37, "version": 1, "private": null, "views": 11 }, { "_id": "5cabdc14213eda507565d4a6", "title": "Zombie Army Trilogy", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/301640/header.jpg", "desc": "The cult horror shooter series comes to an apocalyptic conclusion with an epic new third chapter, a heart-pumping new horde mode, and remastered editions of the best-selling Nazi Zombie Army 1 ", "id": 234, "userID": "266291635715964948", "username": "Josep - CoinDreams.io", "priceUSD": 38, "price": 1624.01, "version": 1, "private": null, "views": 10 }, { "_id": "5ca7be9cc64f2c5bdb9350d6", "title": "Dead Island Definitive Edition", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/383150/header.jpg?t=1554421299", "desc": "Welcome to the zombie apocalypse experience of a lifetime – and now more beautiful than ever. Caught in the midst of an epic zombie outbreak on the tropical island of Banoi, your only thought is: Survive!", "id": 161, "userID": "547230271599280139", "username": "ZENZO Arcade", "priceUSD": 7, "price": 299.16, "version": 1, "private": null, "views": 9 }, { "_id": "5c7015defb92327330350fdb", "title": "Crookz - The Big Heist", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/310490/header.jpg", "desc": "Crookz - The Big Heist is a tactical strategy game set in the funky 1970’s with a slick and groovy atmosphere. Show off the art of thieving by plotting stylish heists and robberies; utilizing espionage and quick-thinking to avoid detection.", "id": 92, "userID": "488377416163786753", "username": "JSKitty | PIVX.org", "price": "500", "private": null, "views": 8 }, { "_id": "5caa3f84d79ff8157ebd62b5", "title": "Dark Souls III", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/374320/header.jpg?t=1553251330", "desc": "\nAs fires fade and the world falls into ruin, journey into a universe filled with more colossal enemies and environments. Players will be immersed into a world of epic atmosphere and darkness through faster gameplay and amplified combat intensity. Fans and newcomers alike will get lost in the game hallmark rewarding gameplay and immersive graphics. \nNow only embers remain… Prepare yourself once more and Embrace The Darkness!", "id": 222, "userID": "547230271599280139", "username": "ZENZO Arcade", "priceUSD": 25, "price": 1068.43, "version": 1, "private": null, "views": 8 }, { "_id": "5cabd593213eda507565d4a1", "title": "Purrfect Date - Visual Novel/Dating Simulator", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/520600/header.jpg", "desc": "As Cat Island’s newest arrival, it’s not long before you realise something’s seriously amiss, or should we say… amorous! A blend of mystery, intrigue and wickedly black humour, will you discover your Purrfect Date before it’s too late? Remember, curiosity killed the cat...", "id": 229, "userID": "266291635715964948", "username": "Josep - CoinDreams.io", "priceUSD": 5, "price": 213.69, "version": 1, "private": null, "views": 8 }, { "_id": "5cadfe9c518e2f0b46cae2da", "title": "Call of Duty: Black Ops III", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/311210/header_alt_assets_0.jpg?t=1554405718", "desc": "Call of Duty®: Black Ops III Zombies Chronicles Edition includes the full base game and the Zombies Chronicles content expansion.\n\nCall of Duty: Black Ops III combines three unique game modes: Campaign, Multiplayer, and Zombies, providing fans with the deepest and most ambitious Call of Duty ever.\n\nThe Zombies Chronicles content expansion delivers 8 remastered classic Zombies maps from Call of Duty®: World at War, Call of Duty®: Black Ops and Call of Duty®: Black Ops II. Complete maps from the original saga are fully remastered and HD playable within Call of Duty®: Black Ops III.", "id": 241, "userID": "547230271599280139", "username": "ZENZO Arcade", "priceUSD": 25, "price": 1068.43, "version": 1, "private": null, "views": 8 }, { "_id": "5cb34fb83d55e26c2c40649a", "title": "Cursed Sight", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/360550/header.jpg", "desc": "Being able to control fate would be a blessing for many. To Miyon, it is her greatest curse.", "id": 254, "userID": "266291635715964948", "username": "Josep - CoinDreams.io", "priceUSD": 4, "price": 170.95, "version": 1, "private": null, "views": 8 }, { "_id": "5cb926850a4c43146ec4a71c", "title": "METAL SLUG 2", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/366260/header.jpg", "desc": "“METAL SLUG 2”, the 2nd entry in SNK’s emblematic 2D run ", "id": 267, "userID": "266291635715964948", "username": "Josep - CoinDreams.io", "priceUSD": 6.5, "price": 277.79, "version": 1, "private": null, "views": 7 }, { "_id": "5cb927830a4c43146ec4a71e", "title": "PewDiePie Legend of the Brofist", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/390520/header.jpg", "desc": "Join your favorite YouTubers on an Epic Quest in PewDiePie: Legend of the Brofist.", "id": 269, "userID": "266291635715964948", "username": "Josep - CoinDreams.io", "priceUSD": 7, "price": 299.16, "version": 1, "private": null, "views": 7 }, { "_id": "5cba4f2b0a4c43146ec4a72f", "title": "Sparkle 2", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/370550/header.jpg", "desc": "Challenge the darkness with your swift orb matching skills, mighty magical enchantments and earthshaking powerups. Match the orbs before they fall into the abyss and find your way through mysterious lands of startling beauty!", "id": 283, "userID": "266291635715964948", "username": "Josep - CoinDreams.io", "priceUSD": 5.5, "price": 235.05, "version": 1, "private": null, "views": 7 }, { "_id": "5cdd9d31267eb573fdf86eb9", "title": "Risk of Rain 2", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/632360/header.jpg?t=1557772296", "desc": "The classic multiplayer roguelike, Risk of Rain, returns with an extra dimension and more challenging action. Play solo, or team up with up to three friends to fight your way through hordes of monsters, unlock new loot, and find a way to escape the planet.", "id": 325, "userID": "547230271599280139", "username": "ZENZO Arcade", "priceUSD": 17.5, "price": 747.9, "version": 1, "private": null, "views": 7 }, { "_id": "5ca4d9b4c64f2c5bdb9350c9", "title": "Mount and Blade: Warband", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/48700/header.jpg?t=1542899168", "desc": "In a land torn asunder by incessant warfare, it is time to assemble your own band of hardened warriors and enter the fray. Lead your men into battle, expand your realm, and claim the ultimate prize: the throne of Calradia! Mount ", "id": 149, "userID": "547230271599280139", "username": "ZENZO Arcade", "priceUSD": 10, "price": 427.37, "version": 1, "private": null, "views": 6 }, { "_id": "5ca7c28cc64f2c5bdb9350d7", "title": "Call of Duty 4: Modern Warfare", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/7940/header.jpg?t=1545234949", "desc": "The new action-thriller from the award-winning team at Infinity Ward, the creators of the Call of Duty® series, delivers the most intense and cinematic action experience ever. Call of Duty 4: Modern Warfare arms gamers with an arsenal of advanced and powerful modern day firepower and transports them to the most treacherous hotspots around the globe to take on a rogue enemy group threatening the world.\nAs both a U.S Marine and British S.A.S. soldier fighting through an unfolding story full of twists and turns, players use sophisticated technology, superior firepower and coordinated land and air strikes on a battlefield where speed, accuracy and communication are essential to victory. The epic title also delivers an added depth of multiplayer action providing online fans an all-new community of persistence, addictive and customizable gameplay.", "id": 162, "userID": "547230271599280139", "username": "ZENZO Arcade", "priceUSD": 11, "price": 470.11, "version": 1, "private": null, "views": 6 }, { "_id": "5ca7d91ec64f2c5bdb9350e0", "title": "FEZ", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/224760/header.jpg?t=1472521163", "desc": "Gomez is a 2D creature living in a 2D world. Or is he? When the existence of a mysterious 3rd dimension is revealed to him, Gomez is sent out on a journey that will take him to the very end of time and space. Use your ability to navigate 3D structures from 4 distinct classic 2D perspectives.", "id": 171, "userID": "547230271599280139", "username": "ZENZO Arcade", "priceUSD": 6, "price": 256.42, "version": 1, "private": null, "views": 6 }, { "_id": "5cadfcc3518e2f0b46cae2d9", "title": "DOOM", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/379720/header.jpg?t=1533678963", "desc": "Now includes all three premium DLC packs (Unto the Evil, Hell Followed, and Bloodfall), maps, modes, and weapons, as well as all feature updates including Arcade Mode, Photo Mode, and the latest Update 6.66, which brings further multiplayer improvements as well as revamps multiplayer progression.", "id": 240, "userID": "547230271599280139", "username": "ZENZO Arcade", "priceUSD": 15, "price": 641.06, "version": 1, "private": null, "views": 6 }, { "_id": "5cadff1a518e2f0b46cae2db", "title": "Plantera ", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/421040/header.jpg?t=1526972226", "desc": "n Plantera you build your own garden and watch it grow with new plants, bushes, trees and animals. As you play and expand your garden you will attract Helpers, round blue creatures that will help you with your harvesting tasks.", "id": 242, "userID": "547230271599280139", "username": "ZENZO Arcade", "priceUSD": 2, "price": 85.47, "version": 1, "private": null, "views": 6 }, { "_id": "5cae1bd5518e2f0b46cae2e4", "title": "Wish -tale of the sixteenth night of lunar month-", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/392370/header.jpg", "desc": "An Eastern approach to storytelling, a visual novel with strong battle, human, and supernatural elements to create a compelling and original story straight from the doujin community of Japan!", "id": 250, "userID": "266291635715964948", "username": "Josep - CoinDreams.io", "priceUSD": 4, "price": 170.95, "version": 1, "private": null, "views": 6 }, { "_id": "5c6af6a834ab2d31a232978d", "title": "COD Advanced Warfare: Ltd Edition Exoskeleton DLC", "platform": "xbox", "image": "https://proxy.duckduckgo.com/iu/?u=http://www.gamepur.com/files/images/2014/call-of-duty-advanced-warfare/screenshot-1.jpg", "desc": "XBOX LIVE / XBOX ONE GLOBAL DLC Key. \nCall of Duty: Advanced Warfare - Ltd Edition Exoskeleton DLC.", "id": 87, "userID": "514223528443248651", "username": "Cryptonite", "price": "120", "private": null, "views": 5 }, { "_id": "5c6e699b4bdefe3a4405a963", "title": "Car Mechanic Simulator 2015", "platform": "Steam", "image": "https://images-na.ssl-images-amazon.com/images/I/A1rwxy4Xu0L.jpg", "desc": "New cars, new tools, new options, more parts in the next version of Car Mechanic Simulator. Take your wrench. Create and expand your auto repairs service empire. Car Mechanic Simulator 2015 will take you behind the scenes of daily routine in car workshop.", "id": 91, "userID": "274170668545736704", "username": "Bouli | Zenzo.io", "price": "425", "private": null, "views": 5 }, { "_id": "5ca4d612c64f2c5bdb9350c5", "title": "//N.P.P.D. RUSH//- The milk of Ultraviolet", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/270090/header.jpg?t=1447359784", "desc": "Developed by UK based micro-indie team Rail Slave Games, N.P.P.D. RUSH: THE MILK OF ULTRA VIOLET is an intense, vehicular, open world, arena shooter combined with lite RPG elements and a 80s British bedroom programmer feel. There is also an exclusive track written by British electro artist MANPANICS plus classic tracks written by Dylan Barry, Founder of Rail Slave Games.", "id": 145, "userID": "547230271599280139", "username": "ZENZO Arcade", "priceUSD": 2, "price": 85.47, "version": 1, "private": null, "views": 5 }, { "_id": "5ca8a955c64f2c5bdb9350e8", "title": "Broken Age", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/232790/header.jpg?t=1479167342", "desc": "A family friendly, hand-animated, puzzle-filled adventure game with an all-star cast, including Elijah Wood, Jack Black and Masasa Moyo. Funded by a record breaking crowdfunding campaign and designed by industry legend Tim Schafer, Broken Age is a timeless coming-of-age story.", "id": 179, "userID": "547230271599280139", "username": "ZENZO Arcade", "priceUSD": 8, "price": 341.9, "version": 1, "private": null, "views": 5 }, { "_id": "5ca9881ec64f2c5bdb935105", "title": "Forgotten, Not Lost - A Kinetic Novel", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/457490/header.jpg?t=1478088306", "desc": "Forgotten, Not Lost has two of the most important qualities needed to make a visual novel great. The most important part of any visual novel is a strong and thought provoking story that draws out emotions in the reader. This visual novel has a solid story that conveys an important message and puts you in the shoes of the main character. Another important feature that should be present in any visual novel is art that compliments the story and emotions. The art in this visual novel is simple but helps to set the mood as it was intended. I highly recommend this to visual novel fans who enjoy emotional stories and simple yet beautiful art.\n", "id": 208, "userID": "547230271599280139", "username": "ZENZO Arcade", "priceUSD": 2, "price": 85.47, "version": 1, "private": null, "views": 5 }, { "_id": "5caa2d87d79ff8157ebd62ad", "title": "Syberia", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/46500/header.jpg?t=1478599954", "desc": "Kate Walker, a young ambitious lawyer from New York, is handed what seems a fairly straight forward assignment - a quick stopover to handle the sale of an old automaton factory hidden in the alpine valleys, then straight back home to the US.\n\nLittle did she imagine when embarking on this task that her life would be turned upside down. On her expedition across Europe, traveling from Western Europe to the far reaches of Eastern Russia, she encounters a host of incredible characters and locations in her attempt to track down Hans, the genius inventor - the final key to unlock the mystery of Syberia. Her voyage across land and time throws all she values into question, while the deal she sets out to sign turns into a pact with destiny.\n", "id": 214, "userID": "547230271599280139", "username": "ZENZO Arcade", "priceUSD": 5, "price": 213.69, "version": 1, "private": null, "views": 5 }, { "_id": "5caa3d08d79ff8157ebd62b1", "title": "Majesty 2 Collection", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/73020/header.jpg?t=1447354133", "desc": "The Kingmaker game editor enables players to create their own missions. Also included is every item, quest, unit and building previously only available for purchase using the in-game store. This additional content includes new spells, weapons, units, heroes, buildings, quests and more.", "id": 218, "userID": "547230271599280139", "username": "ZENZO Arcade", "priceUSD": 5, "price": 213.69, "version": 1, "private": null, "views": 5 }, { "_id": "5caa3e5fd79ff8157ebd62b2", "title": "The Ship Complete Pack", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/2400/header.jpg?t=1521044912", "desc": "For PC gamers who enjoy multiplayer games with a bit of intelligence, intrigue and ingenuity, The Ship is a murder mystery alternative to traditional FPS multiplayer games. Each player is given a Quarry to kill - and must evade their own Hunter in the process, all set on board a series of 1920s art deco cruise ships.", "id": 219, "userID": "547230271599280139", "username": "ZENZO Arcade", "priceUSD": 1, "price": 42.74, "version": 1, "private": null, "views": 5 }, { "_id": "5caa3f1ed79ff8157ebd62b4", "title": "WeakWood Throne", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/760990/header.jpg?t=1517339530", "desc": "WeakWood Throne is a 2D Action RPG with the open world.\nIn the story you will find out what happened in the WickWood Kingdom; why its inhabitants get poorer every day, and soldiers-beasts wander on their fields; what's wrong with the new king, and how to dethrone him.\nIn the game you can freely travel around the world, while playing as a swordsman, an archer or a mage (or all at once), complete the quests, or go to the forest and earn gold by finding secret items and chests.\nGo on your adventure through the kingdom and defeat every enemy on your way!", "id": 221, "userID": "547230271599280139", "username": "ZENZO Arcade", "priceUSD": 3, "price": 128.21, "version": 1, "private": null, "views": 5 }, { "_id": "5cc63eb80890007e19d71a80", "title": "Sparkle 2", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/370550/header.jpg", "desc": "Challenge the darkness with your swift orb matching skills, mighty magical enchantments and earthshaking powerups. Match the orbs before they fall into the abyss and find your way through mysterious lands of startling beauty!", "id": 299, "userID": "266291635715964948", "username": "Josep - CoinDreams.io", "priceUSD": 6.5, "price": 277.79, "version": 1, "private": null, "views": 5 }, { "_id": "5c6819743daab364743c01ee", "title": "Max: The Curse of Brotherhood", "platform": "Xbox Live", "image": "https://proxy.duckduckgo.com/iu/?u=https://i.ytimg.com/vi/7GpaBJ8SDqM/maxresdefault.jpg", "desc": "XBOX LIVE/XBOX 360 GLOBAL KEY. \nMax: The Curse of Brotherhood is a classic action-adventure. At its core it is a platformer filled with puzzles. Max must start on a quest to save his brother who is kidnapped to a hostile world. His only chance to succeed is to stay courageous and use the powers of his marker to manipulate the environment. Unleash the many powers of the Marker and beat the evil kidnapper!", "id": 85, "userID": "514223528443248651", "username": "Cryptonite", "price": "600", "private": null, "views": 4 }, { "_id": "5ca4d42dc64f2c5bdb9350c4", "title": "iBomber Defense Pacific", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/206690/header.jpg?t=1447355344", "desc": "Bomber Defense Pacific takes tower defense to a whole new level and makes you feel like you're right there and part of the incredible action. iBomber Defense Pacific has all-new tactics, all-new strategies, all-new maps, all-new weapons, and all-new enemies.", "id": 144, "userID": "547230271599280139", "username": "ZENZO Arcade", "priceUSD": 3, "price": 128.21, "version": 1, "private": null, "views": 4 }, { "_id": "5ca8aa80c64f2c5bdb9350eb", "title": " Puzzle Agent 2", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/94590/header.jpg?t=1447354362", "desc": "Agent Nelson Tethers just solved his biggest case yet. So why isn't he satisfied? Venture back to eerie Scoggins, Minnesota to solve the mystery of \"the Hidden People\" once and for all!", "id": 182, "userID": "547230271599280139", "username": "ZENZO Arcade", "priceUSD": 6, "price": 256.42, "version": 1, "private": null, "views": 4 }, { "_id": "5ca97f34c64f2c5bdb935101", "title": "Gears of War 4", "platform": "XBOX LIVE   Windows 10 ", "image": "https://www.hrkgame.com/media/games/.thumbnails/gear-of-war-4.jpg/gear-of-war-4-460x215.jpg", "desc": "The leader of the reformed Coalition of Ordered Governments, First Minister Jinn (Angel Desai), commemorates the 25th anniversary of humanity's victory over the Locust. Meanwhile, an elderly Hoffman who is present at the ceremony recounts past battles at Aspho Fields, Emergence Day, and Anvil Gate.\n\nMeanwhile, J.D. and Del have recently deserted the COG after disagreeing with Jinn's hardline policies and join a group of Outsiders led by Reyna (Justina Machado). In order to help their village, J.D. and Del decide to raid a nearby COG settlement under construction to steal a special fabricator. They are accompanied by Kait, Reyna's daughter, and her uncle Oscar (Jimmy Smits), a former Gear and Locust War veteran. Though they are forced to battle the COG's new robotic DeeBee soldiers, J.D. and his group manage to successfully steal the fabricator and escape back to their village. They are then confronted by Jinn (broadcasting via a DeeBee), who accuses them of kidnapping her people, much to their confusion, before launching an all out assault on the village.[6] J.D. and his friends manage to repel Jinn's forces and get to work repairing the village's power generator. However, in the midst of repairs, unknown creatures raid the village, capturing everybody including Reyna and Oscar. As her last act, Reyna locks J.D., Del, and Kait inside the power station to protect them.", "id": 204, "userID": "547230271599280139", "username": "ZENZO Arcade", "priceUSD": 4.5, "price": 192.32, "version": 1, "private": null, "views": 4 }, { "_id": "5caa291ed79ff8157ebd62a8", "title": "THE KING OF FIGHTERS XIII STEAM EDITION", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/222940/header.jpg?t=1512984182", "desc": "“THE KING OF FIGHTERS XIII”, SNK PLAYMORE’s flagship 2D versus fighting title returns in an ultimate version on Steam!!\nThe many features exclusive to the console version of the game, such as the ONLINE Mode that allows you to enjoy smooth online versus matches with rivals from around the world, the Tutorial Mode which can be enjoyed by KOF novice players, and the Story Mode which features several exclusive episodes in a Visual Novel format, have been improved are still available in “THE KING OF FIGHTERS XIII Steam Edition”!\nIn addition, \"Iori with the Power of Flames”, “NESTS Style Kyo”, and “Mr. Karate\" DLC characters are now playable from the start, for a total roster of 36 characters! \nThe time has come to face rivals worldwide!", "id": 209, "userID": "547230271599280139", "username": "ZENZO Arcade", "priceUSD": 8, "price": 341.9, "version": 1, "private": null, "views": 4 }, { "_id": "5caa2d07d79ff8157ebd62ac", "title": "Into the Breach", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/590380/header.jpg?t=1541171325", "desc": "Control powerful mechs from the future to defeat an alien threat. Each attempt to save the world presents a new randomly generated challenge in this turn-based strategy game.", "id": 213, "userID": "547230271599280139", "username": "ZENZO Arcade", "priceUSD": 8, "price": 341.9, "version": 1, "private": null, "views": 4 }, { "_id": "5caa404ed79ff8157ebd62b7", "title": "Dead by Daylight", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/381210/header.jpg?t=1554392450", "desc": "Dead by Daylight is a multiplayer (4vs1) horror game where one player takes on the role of the savage Killer, and the other four players play as Survivors, trying to escape the Killer and avoid being caught and killed.", "id": 224, "userID": "547230271599280139", "username": "ZENZO Arcade", "priceUSD": 10, "price": 427.37, "version": 1, "private": null, "views": 4 }, { "_id": "5cabd453213eda507565d49f", "title": "Resident Evil Revelations / Biohazard Revelations", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/222480/header.jpg", "desc": "Resident Evil® Revelations returns redefined for PC complete with high quality HD visuals, enhanced lighting effects and an immersive sound experience.", "id": 227, "userID": "266291635715964948", "username": "Josep - CoinDreams.io", "priceUSD": 15, "price": 641.06, "version": 1, "private": null, "views": 4 }, { "_id": "5cabdf51213eda507565d4a9", "title": "Observer / >observer_", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/514900/header.jpg", "desc": "What would you do if your fears were hacked? >observer_ is a cyberpunk horror game from Bloober Team, the creators of Layers of Fear. Play as an Observer, the new front line of neural police, as you hack into the jagged minds of the insane.", "id": 237, "userID": "266291635715964948", "username": "Josep - CoinDreams.io", "priceUSD": 23, "price": 982.95, "version": 1, "private": null, "views": 4 }, { "_id": "5cae1759518e2f0b46cae2e0", "title": "Little Nightmares", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/424840/header.jpg", "desc": "Immerse yourself in Little Nightmares, a dark whimsical tale that will confront you with your childhood fears! Help Six escape The Maw – a vast, mysterious vessel inhabited by corrupted souls looking for their next meal.", "id": 246, "userID": "266291635715964948", "username": "Josep - CoinDreams.io", "priceUSD": 15, "price": 641.06, "version": 1, "private": null, "views": 4 }, { "_id": "5cae1c78518e2f0b46cae2e5", "title": "Mutiny!!", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/669050/header.jpg", "desc": "Mutiny!! is set in a world of fantasy, and adventure. A realm where airships can sail among the clouds as well as the sea, entering the flogiston to journey to other planes. There’s treasure spread out over many planes if you’re brave or curious enough to find it!", "id": 251, "userID": "266291635715964948", "username": "Josep - CoinDreams.io", "priceUSD": 8, "price": 341.9, "version": 1, "private": null, "views": 4 }, { "_id": "5cb927fb0a4c43146ec4a71f", "title": "Revhead", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/589760/header.jpg", "desc": "Revhead is a car racing simulation game, where you have to build your own race car. You start your journey somewhere in a small village in Australia. You have to think as a real Revhead! You can buy or sell cars and components, fix and tweak your car to make it the fastest around.", "id": 270, "userID": "266291635715964948", "username": "Josep - CoinDreams.io", "priceUSD": 18, "price": 769.27, "version": 1, "private": null, "views": 4 }, { "_id": "5cba4cbe0a4c43146ec4a72a", "title": "Tennis in the Face", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/394290/header.jpg", "desc": "Shoot tennis balls at your adversaries and save the city from the evil Explodz Inc. This is no Wimbledon, this is Tennis in the Face! Get ready for some hilarious ragdoll-smashing ball-bouncing action!", "id": 278, "userID": "266291635715964948", "username": "Josep - CoinDreams.io", "priceUSD": 3.5, "price": 149.58, "version": 1, "private": null, "views": 4 }, { "_id": "5cba4fd90a4c43146ec4a731", "title": "Turmoil", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/361280/header.jpg", "desc": "Drill for oil like it's 1899! Turmoil offers players a visually charming, tongue-in-cheek take on the simulation genre inspired by the 19th century oil rush in North America.", "id": 285, "userID": "266291635715964948", "username": "Josep - CoinDreams.io", "priceUSD": 9, "price": 384.63, "version": 1, "private": null, "views": 4 }, { "_id": "5cba51c10a4c43146ec4a733", "title": "Kingdom Rush", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/246420/header.jpg", "desc": "Get ready for an epic journey to defend your kingdom against hordes of orcs, trolls, evil wizards and other nasty fiends using a vast arsenal of towers and spells at your command!Fight on forests, mountains and wastelands, customizing your defensive strategy with different tower upgrades and specializations!", "id": 287, "userID": "266291635715964948", "username": "Josep - CoinDreams.io", "priceUSD": 9, "price": 384.63, "version": 1, "private": null, "views": 4 }, { "_id": "5cc63ff30890007e19d71a83", "title": "Azkend 2: The World Beneath", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/550440/header.jpg", "desc": "Azkend 2: The World Beneath is a beautifully polished match-three adventure game set in an awe-inspiring underground world. Enjoy superbly smooth casual matching puzzle gameplay, an engaging storyline with voiceovers, and hidden object minigames.", "id": 302, "userID": "266291635715964948", "username": "Josep - CoinDreams.io", "priceUSD": 6.5, "price": 277.79, "version": 1, "private": null, "views": 4 }, { "_id": "5ca8a8fcc64f2c5bdb9350e7", "title": "Stronghold Crusader 2", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/232890/header.jpg?t=1548159304", "desc": "Stronghold Crusader 2 is the long awaited sequel to the original castle sim. After 12 years Stronghold returns to the desert with a new 3D engine and powerful Havok Physics. Crusader 2 recaptures the original game’s addictive, fast-paced gameplay and authentic castle simulation.", "id": 178, "userID": "547230271599280139", "username": "ZENZO Arcade", "priceUSD": 8, "price": 341.9, "version": 1, "private": null, "views": 3 }, { "_id": "5ca94e0ac64f2c5bdb9350fb", "title": "Serial Cleaner", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/522210/header.jpg?t=1553769753", "desc": "Slip on your flares, grab your shades and hop in your station wagon, it's time to work… as a mob professional cleaner. A good cleaner never gets caught, so you have to make sure you get in, clean up and get out without leaving a trace of evidence in this stylish award winning 2D action-stealth game.", "id": 198, "userID": "547230271599280139", "username": "ZENZO Arcade", "priceUSD": 8, "price": 341.9, "version": 1, "private": null, "views": 3 }, { "_id": "5caa3caad79ff8157ebd62b0", "title": "Darkest Hour: A Hearts of Iron Game", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/73170/header.jpg?t=1521720669", "desc": "Developed by a team of experienced modders from the Paradox forum, Darkest Hour is a stand-alone Hearts of Iron game. The game features a mixture of short and in-depth campaigns set across the darkest chapters of the 20th century. Play from the outbreak of the Great War up until the onset of the Cold War.", "id": 217, "userID": "547230271599280139", "username": "ZENZO Arcade", "priceUSD": 4, "price": 170.95, "version": 1, "private": null, "views": 3 }, { "_id": "5caa3eb3d79ff8157ebd62b3", "title": "Two Worlds II HD", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/7520/header.jpg?t=1535036908", "desc": "\nA breathtaking journey into Antaloor's past.\nAfter the downfall of Aziraal, God of Fire, the Dark Lord Gandohar has nearly achieved his objective to disrupt the balance between the elements. Dark magic surges into the land to fill the void. Recognizing the potential for complete control over the dark powers, Gandohar starts to use the power of Aziraal trap within Kyra, the descendant of the Orphans. Despite her ancestry, Kyra cannot endure the strain. With Antaloor already in his clutches, Gandohar concocts a new plan from his stronghold in Oswaroth. There are still those who struggle against the tyrant, hoping to shift the balance of forces in their favor. The fight for Antaloor continues...\nFive years have passed since dramatic events brought the whole world to the edge of the abyss. The hero is a prisoner in the dungeons of Gandohar's castle. His hopes of saving his sister vanished with his freedom. Just as despair threatens to overcome him, hope comes from where he would have least expected. The Orcs, a race the hero had always hated, have put together a rescue squad that frees the hero from his bonds. He emerges into a land desecrated by evil. He embarks on a journey to shed light on Gandohar's dark past, hoping to discover a weak point in his enemy's defense. If he fails, he will lose his sister forever.", "id": 220, "userID": "547230271599280139", "username": "ZENZO Arcade", "priceUSD": 8, "price": 341.9, "version": 1, "private": null, "views": 3 }, { "_id": "5cabd66c213eda507565d4a2", "title": "The Dwarves", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/403970/header.jpg", "desc": "A few heroes are facing hundreds of foes – are you even able to lead the coolest fantasy people to victory against the dark hordes? Explore a vast world, fight tactical real-time battles, and experience the fantastic story based on the bestseller \"The Dwarves\".", "id": 230, "userID": "266291635715964948", "username": "Josep - CoinDreams.io", "priceUSD": 25, "price": 1068.43, "version": 1, "private": null, "views": 3 }, { "_id": "5cabd78d213eda507565d4a3", "title": "7 Days to Die", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/251570/header.jpg", "desc": "7 Days to Die is an open-world game that is a unique combination of first person shooter, survival horror, tower defense, and role-playing games. Play the definitive zombie survival sandbox RPG that came first. Navezgane awaits!", "id": 231, "userID": "266291635715964948", "username": "Josep - CoinDreams.io", "priceUSD": 18, "price": 769.27, "version": 1, "private": null, "views": 3 }, { "_id": "5cae144c518e2f0b46cae2dd", "title": "Project CARS 2", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/378860/header.jpg", "desc": "THE ULTIMATE DRIVER JOURNEY! Project CARS 2 delivers the soul of motor racing in the world’s most beautiful, authentic, and technically-advanced racing game.", "id": 243, "userID": "266291635715964948", "username": "Josep - CoinDreams.io", "priceUSD": 47.5, "price": 2030.01, "version": 1, "private": null, "views": 3 }, { "_id": "5cb352ae3d55e26c2c40649d", "title": "Oppaidius Summer Trouble!", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/716030/header.jpg", "desc": "An ecchi visual novel with a '90s retro vibe! It features original FM-synth music (Yamaha YM2151 sound chip), pixel art (PC-98) backgrounds, and yes, oppai!", "id": 257, "userID": "266291635715964948", "username": "Josep - CoinDreams.io", "priceUSD": 6.5, "price": 277.79, "version": 1, "private": null, "views": 3 }, { "_id": "5cb356e63d55e26c2c4064a1", "title": "Guardians Of The Past", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/846130/header.jpg", "desc": "Guardians of the Past is a fast-paced arena brawler where you use gadgets to battle with or against your friends in a variety of arenas constructed by YOU! Build an array of launch-pads, fields of electrical chaos or even a sea of fire. With hundreds of combinations, every game is unique!", "id": 261, "userID": "266291635715964948", "username": "Josep - CoinDreams.io", "priceUSD": 9, "price": 384.63, "version": 1, "private": null, "views": 3 }, { "_id": "5cb358cc3d55e26c2c4064a4", "title": "One Gun: Cat", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/924900/header.jpg", "desc": "Protect the world of One Gun from evil invaders!", "id": 264, "userID": "266291635715964948", "username": "Josep - CoinDreams.io", "priceUSD": 8.5, "price": 363.27, "version": 1, "private": null, "views": 3 }, { "_id": "5cba4bb50a4c43146ec4a728", "title": "Slain Back from Hell", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/369070/header.jpg", "desc": "Slain: Back from Hell. A heavy metal inspired arcade combat with puzzle elements and gore galore. Stunning visuals and true old school gameplay accompanied by the most metal soundtrack you've ever heard.", "id": 276, "userID": "266291635715964948", "username": "Josep - CoinDreams.io", "priceUSD": 11, "price": 470.11, "version": 1, "private": null, "views": 3 }, { "_id": "5cc63eff0890007e19d71a81", "title": "Baseball Riot", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/567660/header.jpg", "desc": "Start a baseball riot! Help Gabe Carpaccio take vengeance on the unholy alliance of his former team and a corrupt energy drink manufacturer Explodz Inc. in this fun physics based puzzle game! Baseball Riot is a sequel to Tennis in the Face.", "id": 300, "userID": "266291635715964948", "username": "Josep - CoinDreams.io", "priceUSD": 3.5, "price": 149.58, "version": 1, "private": null, "views": 3 }, { "_id": "5ccb3cae0e90f95b56bf3912", "title": "Unbox: Newbie's Adventure", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/512300/header.jpg", "desc": "Unbox: Newbie's Adventure is a 90s style 3D platformer about the ultimate postal service, self-delivering cardboard boxes! Unbox: Newbie's Adventure has giant worlds full of challenges, collectibles and boxy boss battles!", "id": 311, "userID": "266291635715964948", "username": "Josep - CoinDreams.io", "priceUSD": 15, "price": 641.06, "version": 1, "private": null, "views": 3 }, { "_id": "5ccb40620e90f95b56bf3914", "title": "Creature Romances: Kokonoe Kokoro", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/356450/header.jpg", "desc": "A short love story with a twist: the love of your life is 50% human, and 50% grasshopper.", "id": 313, "userID": "266291635715964948", "username": "Josep - CoinDreams.io", "priceUSD": 2, "price": 85.47, "version": 1, "private": null, "views": 3 }, { "_id": "5ccb44040e90f95b56bf3917", "title": "Ladykiller in a Bind", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/560000/header.jpg", "desc": "An erotic romantic comedy about social manipulation, crossdressing, and girls tying up other girls. Will the hapless lesbian ladykiller Beast succeed at pretending to be her ruthless twin? By the creators of Analogue: A Hate Story, featuring choice-driven mechanics... and lots of sex.", "id": 316, "userID": "266291635715964948", "username": "Josep - CoinDreams.io", "priceUSD": 18, "price": 769.27, "version": 1, "private": null, "views": 3 }, { "_id": "5cdd9aa0267eb573fdf86eb7", "title": "XCOM 2", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/268500/header.jpg?t=1553038039", "desc": "XCOM 2 is the sequel to XCOM: Enemy Unknown, the 2012 award-winning strategy game of the year. Earth has changed and is now under alien rule. Facing impossible odds you must rebuild XCOM, and ignite a global resistance to reclaim our world and save humanity.", "id": 323, "userID": "547230271599280139", "username": "ZENZO Arcade", "priceUSD": 30, "price": 1282.11, "version": 1, "private": null, "views": 3 }, { "_id": "5ca4d247c64f2c5bdb9350c2", "title": "//SNOWFLAKE TATTOO//", "platform": "steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/355430/header.jpg", "desc": "\"Your Dollsteak is in another castle\". Straight from the maths paper of the British bedroom programming scene into your imagination. Serial \"fever dreamers\" and curio/avant-garde masters Railslavegames return with the prequel to //NPPD RUSH// The milk of ultra violet.", "id": 142, "userID": "547230271599280139", "username": "ZENZO Arcade", "priceUSD": 2, "price": 85.47, "version": 1, "private": null, "views": 2 }, { "_id": "5ca4d313c64f2c5bdb9350c3", "title": "Pixel Puzzles 2: Anime", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/350810/header.jpg?t=1544285514", "desc": "Pixel Puzzles 2: Anime is a traditional style jigsaw puzzle game, featuring 25 hand drawn images in a Kawaii style, with each puzzle piece uniquely shaped in a way no physical puzzle could be. Use Pixel Pixie's dust powers to help solve puzzles. Ghosts, rotations, locations - the pixel pixie can help with it all because no pixel puzzling anime experience would be complete without a fairy addicted to dust!", "id": 143, "userID": "547230271599280139", "username": "ZENZO Arcade", "priceUSD": 4, "price": 170.95, "version": 1, "private": null, "views": 2 }, { "_id": "5ca4ded7c64f2c5bdb9350cd", "title": "Just Cause 2", "platform": "Xbox One", "image": "https://4.bp.blogspot.com/-LYOWUCTZLYQ/VORTv80DJMI/AAAAAAAAAKM/pxvUND0bRYU/s1600/Just-Cause-22-600x300.jpg", "desc": "Just Cause 2 is a 2010 open world action-adventure video game developed by Avalanche Studios, published by Eidos Interactive and distributed by Square Enix for Microsoft Windows, PlayStation 3 and Xbox 360. The sequel to 2006's Just Cause, it was powered by Avalanche Studios' Avalanche 2.0 Engine.", "id": 152, "userID": "547230271599280139", "username": "ZENZO Arcade", "priceUSD": 9, "price": 384.63, "version": 1, "private": null, "views": 2 }, { "_id": "5ca7b7efc64f2c5bdb9350d2", "title": "Space Farmers", "platform": "steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/271570/header.jpg?t=1447359976", "desc": "Grab a friend, grab a gadget, grab a gun and get ready for the most fun you'll ever have in a co-op game!", "id": 157, "userID": "547230271599280139", "username": "ZENZO Arcade", "priceUSD": 2, "price": 85.47, "version": 1, "private": null, "views": 2 }, { "_id": "5ca7b839c64f2c5bdb9350d3", "title": "Pixel puzzles 2 Birds", "platform": "steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/344230/header.jpg?t=1544285533", "desc": "Pixel Puzzles 2: Birds is a traditional style jigsaw puzzle game, with crabs scurrying around so WATCH YOUR FINGERS!!!", "id": 158, "userID": "547230271599280139", "username": "ZENZO Arcade", "priceUSD": 2, "price": 85.47, "version": 1, "private": null, "views": 2 }, { "_id": "5ca7cec7c64f2c5bdb9350d8", "title": "Sniper Elite 3", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/238090/header.jpg?t=1553091240", "desc": "Sniper Elite 3 is a tactical third-person shooter that combines stealth, gameplay choice and genre-defining ballistics with huge, open levels and the exotic terrain of World War 2 North Africa.", "id": 163, "userID": "547230271599280139", "username": "ZENZO Arcade", "priceUSD": 14, "price": 598.32, "version": 1, "private": null, "views": 2 }, { "_id": "5ca7cfa7c64f2c5bdb9350d9", "title": "Sniper Elite V2", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/63380/header.jpg?t=1553091216", "desc": "Sniper Elite V2 is an award-winning and authentic World War II sniping experience. You are elite US sniper Karl Fairburne. Parachuted into Berlin amidst the Germans’ final stand, your mission is to prevent Nazi V2 rocket program technology from falling into the hands of the besieging Red Army. You must aid key scientists keen to defect to the US, and terminate those who would help the Russians.", "id": 164, "userID": "547230271599280139", "username": "ZENZO Arcade", "priceUSD": 8, "price": 341.9, "version": 1, "private": null, "views": 2 }, { "_id": "5ca7d971c64f2c5bdb9350e1", "title": "Beatbuddy: Tale of the Guardians", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/231040/header.jpg?t=1513335686", "desc": "Awakened from his slumber, Beatbuddy journeys through lush hand-painted environments on a quest to save his companions and his own immortality. Beatbuddy interacts with the living breathing environment that pulses to the beat of an original soundtrack, aiding him as he unlocks new paths and solves puzzles.", "id": 172, "userID": "547230271599280139", "username": "ZENZO Arcade", "priceUSD": 5, "price": 213.69, "version": 1, "private": null, "views": 2 }, { "_id": "5ca7dbd6c64f2c5bdb9350e5", "title": "Viking: Battle for Asgard", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/211160/header.jpg?t=1522072461", "desc": "A fierce struggle is taking place within Asgard, the realm of the Norse Gods. The battle has escalated, spilling over to the mortal world of Midgard and now a Champion must be found, a Warrior than can sway this war that threatens the fate of Asgard and the Gods themselves. \n\nThe goddess Hel – daughter of Loki, Norse God of mischief, has been banished from the heavenly kingdom of Asgard for defying Odin’s rule. Angry at her fate, she seeks to release the ancient wolf-god Fenrir which legend tells will bring about Ragnarok - the apocalyptic battle that will destroy Asgard and the Gods. With her army of resurrected Viking warriors, Hel marches on the unsuspecting mortal realm of Midgard. \n", "id": 176, "userID": "547230271599280139", "username": "ZENZO Arcade", "priceUSD": 8, "price": 341.9, "version": 1, "private": null, "views": 2 }, { "_id": "5ca8a9a7c64f2c5bdb9350e9", "title": " Saints Row 2", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/9480/header.jpg?t=1533712729", "desc": "Saints Row 2 brings true freedom to open-world gaming. Players can play as who they want, how they want, and with whomever, they want in this sequel to the much acclaimed and tremendously successful Saints Row.", "id": 180, "userID": "547230271599280139", "username": "ZENZO Arcade", "priceUSD": 8, "price": 341.9, "version": 1, "private": null, "views": 2 }, { "_id": "5ca8aad6c64f2c5bdb9350ec", "title": "Hector: Badge of Carnage", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/94620/header.jpg?t=1495053608", "desc": "Detective Inspector Hector – the hard-nosed, soft-bellied lawman of Clappers Wreake, a town that took the “Great” out of Britain. He’s violent, drunken, and has a taste for all things criminal, corrupt, or smothered in curry.", "id": 183, "userID": "547230271599280139", "username": "ZENZO Arcade", "priceUSD": 8, "price": 341.9, "version": 1, "private": null, "views": 2 }, { "_id": "5ca8ab84c64f2c5bdb9350ed", "title": "Poker Night at the Inventory", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/31280/header.jpg?t=1495058773", "desc": "Prepare for a different kind of poker night in a very different kind of club. In Poker Night at the Inventory, you'll deal with Penny Arcade's clever, cunning Tycho, Team Fortress 2's hulking Heavy, Homestar Runner's self-proclaimed \"awesome icon\" Strong Bad and the hyperkinetic \"rabbity-thing\" from Sam ", "id": 184, "userID": "547230271599280139", "username": "ZENZO Arcade", "priceUSD": 3, "price": 128.21, "version": 1, "private": null, "views": 2 }, { "_id": "5ca8ae68c64f2c5bdb9350ef", "title": "Human: Fall Flat", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/477160/header.jpg?t=1552309159", "desc": "Human: Fall Flat is a quirky open-ended physics-based puzzle platformer set in floating dreamscapes. Your goal is to find the exit of these surreal levels by solving puzzles with nothing but your wits. Local co-op for 2 players and up to 8 online for even more mayhem!", "id": 186, "userID": "547230271599280139", "username": "ZENZO Arcade", "priceUSD": 10, "price": 427.37, "version": 1, "private": null, "views": 2 }, { "_id": "5ca8b048c64f2c5bdb9350f2", "title": " Nightmares from the Deep: The Cursed Heart", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/259740/header.jpg?t=1530538940", "desc": "Would you like to enter a thrilling Pirates world where danger lurks in every corner?\n\nYou are a museum owner pursuing an undead pirate who kidnapped your daughter. You quickly realize that the villain is entangled in a tragic, centuries-old love story, and wants to resurrect his mistress with the girl’s life force. You feel sorry for the pirate, but you have to stop him before it is too late for your daughter…\n\nYou will leave the modern museum quickly, and find your way to rundown pirate settings, all of them three centuries old. Since the time of the golden age of piracy, the locations have become neglected, deserted and overgrown with plants. Full moon, bones laying on the ground, and a skull-shaped rock add to the dark atmosphere of the mysterious island.\nWhat tragic events took place on the island before your arrival? What evil powers can make an old, rotting ship sail? Is the horrifying, undead pirate really as evil as he seems?", "id": 189, "userID": "547230271599280139", "username": "ZENZO Arcade", "priceUSD": 6, "price": 256.42, "version": 1, "private": null, "views": 2 }, { "_id": "5ca8b13ac64f2c5bdb9350f3", "title": "Cook, Serve, Delicious!", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/247020/header.jpg?t=1511845898", "desc": "One of the few hardcore restaurant sims in existence, Cook, Serve, Delicious! is a deceptively easy game to learn but incredibly challenging to master as you progress through your career from owning a terrible zero star cafe into a five star world famous restaurant.", "id": 190, "userID": "547230271599280139", "username": "ZENZO Arcade", "priceUSD": 3, "price": 128.21, "version": 1, "private": null, "views": 2 }, { "_id": "5cabdd00213eda507565d4a7", "title": "Immortal Redneck", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/595140/header.jpg", "desc": "Immortal Redneck is a FPS set in Egypt with rogue-lite elements. Frantic gameplay, twitch controls and an arcade-style feel meet randomly generated dungeons, a complete skill tree, permanent death and 9 classes with different traits.", "id": 235, "userID": "266291635715964948", "username": "Josep - CoinDreams.io", "priceUSD": 18, "price": 769.27, "version": 1, "private": null, "views": 2 }, { "_id": "5cabddc6213eda507565d4a8", "title": "NeuroVoider", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/400450/header.jpg", "desc": "NeuroVoider is a twin-stick shooter RPG set in a cyber futuristic world about brains shooting around evil robots with nuclear rocket launchers. Battle through the horde of vigilant robots, boost your character with the smoking remains of your victims, and defeat the master NeuroVoider.", "id": 236, "userID": "266291635715964948", "username": "Josep - CoinDreams.io", "priceUSD": 12, "price": 512.85, "version": 1, "private": null, "views": 2 }, { "_id": "5cae1569518e2f0b46cae2de", "title": "Regions of Ruin", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/680360/header.jpg", "desc": "Regions of Ruin is a 2D pixel side-scrolling RPG with town-building, where you explore, fight and build into an open world that progressively challenges you and your settlement, and threatens the extinction of the dwarven race.", "id": 244, "userID": "266291635715964948", "username": "Josep - CoinDreams.io", "priceUSD": 9, "price": 384.63, "version": 1, "private": null, "views": 2 }, { "_id": "5cae164b518e2f0b46cae2df", "title": "Q.U.B.E. 2", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/359100/header.jpg", "desc": "Q.U.B.E. 2 is the sequel to the hit first-person puzzle game Q.U.B.E. You are Amelia Cross, a stranded archaeologist who has awoken among the ruins of an ancient alien landscape. With the distant help of another survivor you must solve the puzzles of this mysterious world and find a way back home.", "id": 245, "userID": "266291635715964948", "username": "Josep - CoinDreams.io", "priceUSD": 22.5, "price": 961.59, "version": 1, "private": null, "views": 2 }, { "_id": "5cae1a4f518e2f0b46cae2e2", "title": "Equivoque", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/652700/header.jpg", "desc": "A story-forward visual novelette about a young apprentice who is thrust into a conflict between two magicians; one a famous escape artist, and one a fraudulent medium.", "id": 248, "userID": "266291635715964948", "username": "Josep - CoinDreams.io", "priceUSD": 1, "price": 42.74, "version": 1, "private": null, "views": 2 }, { "_id": "5cae1af2518e2f0b46cae2e3", "title": "When Our Journey Ends - A Visual Novel", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/563520/header.jpg", "desc": "Follow Mariko as she boards a train to a completely different world - A world of unbelievable beings and happenings.", "id": 249, "userID": "266291635715964948", "username": "Josep - CoinDreams.io", "priceUSD": 5, "price": 213.69, "version": 1, "private": null, "views": 2 }, { "_id": "5cb1057a518e2f0b46cae2fa", "title": "Halo Wars 2 XBOX LIVE   Windows 10 ", "platform": "Microsoft", "image": "https://mspoweruser.com/wp-content/uploads/2017/01/Halo-Wars-2-featured.png", "desc": "Arriving at the Ark, Spirit of Fire's crew receives a UNSC signal from the surface of the installation. Spartan Red Team—composed of supersoldiers Alice, Jerome, and Douglas—is deployed to investigate the signal. They recover Isabel from a UNSC base but are attacked by the Banished during exfiltration. Back on Spirit of Fire, Isabel reveals to Captain Cutter how Atriox and the Banished invaded the Ark. Despite Isabel believing resistance hopeless, Cutter declares his intent to confront the Banished. A strike team manages to set up a forward base and defeat Banished forces under the control of Decimus. In the wreckage of Decimus' base, Isabel discovers information about the Ark's Cartographer, a map of key systems and weapons.\n\nThe strike team secures the Cartographer, coming under attack by autonomous Forerunner machines known as Sentinels. Anders discovers that Atriox has hijacked the Ark's teleportation network, allowing him to transport troops across the whole structure. The UNSC forces defeat Decimus and disable the portal network. Spirit of Fire comes under attack from a Banished carrier ship. The attacking carrier is destroyed when Isabel and Jerome hijack its weapon systems to prompt the Sentinels stationed on the Ark to shatter it in two.", "id": 253, "userID": "547230271599280139", "username": "ZENZO Arcade", "priceUSD": 18, "price": 769.27, "version": 1, "private": null, "views": 2 }, { "_id": "5cb356043d55e26c2c4064a0", "title": "Zasa - An AI Story", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/447240/header.jpg", "desc": "Zasa is an extraordinary and challenging 3D Puzzle Game. Players are going to roleplay Zasa the Artificial Intelligence to finish the training missions from Dr.Mason by linking nodes in 3-dimensional space.", "id": 260, "userID": "266291635715964948", "username": "Josep - CoinDreams.io", "priceUSD": 1, "price": 42.74, "version": 1, "private": null, "views": 2 }, { "_id": "5cb357a23d55e26c2c4064a2", "title": "Siege Saga", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/559030/header.jpg", "desc": "Siege Saga is the 2D physics puzzle sandbox in which you must protect yourself by building fortifications against your enemies’ projectiles. It’s like Angry Birds but the other way round!", "id": 262, "userID": "266291635715964948", "username": "Josep - CoinDreams.io", "priceUSD": 7, "price": 299.16, "version": 1, "private": null, "views": 2 }, { "_id": "5cb358483d55e26c2c4064a3", "title": "Tyler: Model 005", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/573370/header.jpg", "desc": "Tyler: Model 005 is a 3D action-platformer and exploration game set in the 1950s where you customize and control a spunky miniature robot named Tyler. Many years after powering down, Tyler is accidentally powered on during a thunderstorm and must discover what has happened to his creator ", "id": 263, "userID": "266291635715964948", "username": "Josep - CoinDreams.io", "priceUSD": 9, "price": 384.63, "version": 1, "private": null, "views": 2 }, { "_id": "5cb92a6f0a4c43146ec4a724", "title": "Miasmata", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/223510/header.jpg", "desc": "Miasmata is a first-person survival/adventure game, developed from the ground-up by brothers Joe and Bob Johnson. You play as Robert Hughes, a plague-stricken scientist on a journey to discover a cure. Your adventure begins on the shores of a remote and mysterious island.", "id": 275, "userID": "266291635715964948", "username": "Josep - CoinDreams.io", "priceUSD": 13, "price": 555.58, "version": 1, "private": null, "views": 2 }, { "_id": "5cba4df70a4c43146ec4a72c", "title": " Funk of Titans", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/383750/header.jpg", "desc": "As Perseus, the son of Zeus and protector of the Funk. Your task is to smash the rap, pop and rock of evil Musical Titans. Only one music can survive and the Funk is the music of the gods.", "id": 280, "userID": "266291635715964948", "username": "Josep - CoinDreams.io", "priceUSD": 6, "price": 256.42, "version": 1, "private": null, "views": 2 }, { "_id": "5cba4ec40a4c43146ec4a72e", "title": "Rise of Insanity", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/629220/header.jpg", "desc": "In Rise of Insanity, as a doctor of psychology you will explore the darkest recesses of the human mind. Overcome your fear to find the truth behind the tragedy that has befallen your family.", "id": 282, "userID": "266291635715964948", "username": "Josep - CoinDreams.io", "priceUSD": 8, "price": 341.9, "version": 1, "private": null, "views": 2 }, { "_id": "5cba54540a4c43146ec4a735", "title": "Figment", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/493540/header.jpg", "desc": "Figment is an action-adventure game that invites you to explore a unique surreal universe filled with music, humor and multi layered narrative. Join Dusty and his ever-optimistic friend, Piper, on an adventure through the different sides of the mind seeking to restore the courage that's been lost.", "id": 289, "userID": "266291635715964948", "username": "Josep - CoinDreams.io", "priceUSD": 18, "price": 769.27, "version": 1, "private": null, "views": 2 }, { "_id": "5cba56ca0a4c43146ec4a736", "title": "Jalopy", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/446020/header.jpg", "desc": "Build, repair, refuel and drive a dilapidated old car on a grand journey through the territories of the former Eastern bloc.", "id": 290, "userID": "266291635715964948", "username": "Josep - CoinDreams.io", "priceUSD": 12.5, "price": 534.21, "version": 1, "private": null, "views": 2 }, { "_id": "5cc63c690890007e19d71a7a", "title": "Spellspire", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/626580/header.jpg", "desc": "Spellspire is a thrilling mashup of word game and action role playing game. Pick letters from a grid to spell words and shoot them from your wand as spells. The longer the word, the bigger the blast! Can you make it to the top of the Spellspire?", "id": 293, "userID": "266291635715964948", "username": "Josep - CoinDreams.io", "priceUSD": 8.5, "price": 363.27, "version": 1, "private": null, "views": 2 }, { "_id": "5cc63ccb0890007e19d71a7b", "title": "Xenoraid: The First Space War", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/460220/header.jpg", "desc": "Xenoraid is a vertically scrolling shoot'em up with procedurally driven missions and detailed shooting mechanics. Modern features such as real time fighter switching and squadron management make Xenoraid a fresh and thrilling shooter!", "id": 294, "userID": "266291635715964948", "username": "Josep - CoinDreams.io", "priceUSD": 8.5, "price": 363.27, "version": 1, "private": null, "views": 2 }, { "_id": "5cc63d1b0890007e19d71a7c", "title": "Neon Chrome", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/428750/header.jpg", "desc": "A masterful combination of top-down shooter and endless replayability with procedural levels. Blast your way through walls ", "id": 295, "userID": "266291635715964948", "username": "Josep - CoinDreams.io", "priceUSD": 13, "price": 555.58, "version": 1, "private": null, "views": 2 }, { "_id": "5cc63e6b0890007e19d71a7f", "title": "Sparkle Unleashed", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/550450/header.jpg", "desc": "Sparkle Unleashed is a wonderfully polished casual action puzzle game. Match like colored orbs before they fall into the abyss, unlock earthshaking powerups, and conquer more than a 100 levels! Carve a path of light through an enchanting world of mystery and magic!", "id": 298, "userID": "266291635715964948", "username": "Josep - CoinDreams.io", "priceUSD": 6.5, "price": 277.79, "version": 1, "private": null, "views": 2 }, { "_id": "5cc63f8d0890007e19d71a82", "title": "Tennis in the Face", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/394290/header.jpg", "desc": "Shoot tennis balls at your adversaries and save the city from the evil Explodz Inc. This is no Wimbledon, this is Tennis in the Face! Get ready for some hilarious ragdoll-smashing ball-bouncing action!", "id": 301, "userID": "266291635715964948", "username": "Josep - CoinDreams.io", "priceUSD": 3, "price": 128.21, "version": 1, "private": null, "views": 2 }, { "_id": "5ccb38ca0e90f95b56bf390d", "title": "Mainlining", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/454950/header.jpg", "desc": "After MI7 has been hacked, your primary goal is to bring a cyber-criminal network to justice. Played entirely from within the environment of your computer's desktop, Mainlining is a thrilling point and click hacking adventure that features a gripping narrative which will have you hooked from the very first case.", "id": 306, "userID": "266291635715964948", "username": "Josep - CoinDreams.io", "priceUSD": 8.5, "price": 363.27, "version": 1, "private": null, "views": 2 }, { "_id": "5ccb3ac30e90f95b56bf390f", "title": "The Rivers of Alice - Extended Version", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/411590/header.jpg", "desc": "The Rivers of Alice is a classic-style, emotional, graphic adventure set in a universe of puzzles and characters from the imagination of vetusta morla. Every time Alice falls asleep, she enters a fantasy world where the player must help her face her fears.", "id": 308, "userID": "266291635715964948", "username": "Josep - CoinDreams.io", "priceUSD": 7.5, "price": 320.53, "version": 1, "private": null, "views": 2 }, { "_id": "5ccb3b650e90f95b56bf3910", "title": "Zombie Kill of the Week - Reborn", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/342300/header.jpg", "desc": "Zombie Kill of the Week - Reborn is a challenging, fast paced, 2D survival shooter! Featuring a compelling single player survival mode and cooperative multiplayer for up-to four players, this is one zombie firefight you're not going to want to miss!", "id": 309, "userID": "266291635715964948", "username": "Josep - CoinDreams.io", "priceUSD": 6, "price": 256.42, "version": 1, "private": null, "views": 2 }, { "_id": "5ccb3bc40e90f95b56bf3911", "title": "The Walking Vegetables", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/704840/header.jpg", "desc": "It’s the 1980’s and an evil alien race has invaded Earth, turning all vegetables into crawling, bawling, mauling abominations. You are about to join Department Radical, the grooviest police force on Earth. Are you a rad enough dude (or dame) to smite these ravenous creatures?", "id": 310, "userID": "266291635715964948", "username": "Josep - CoinDreams.io", "priceUSD": 8.5, "price": 363.27, "version": 1, "private": null, "views": 2 }, { "_id": "5ccb3d210e90f95b56bf3913", "title": " E.T. Armies - Deluxe Edition", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/382420/header.jpg", "desc": "E.T. Armies is an action-packed, fast-paced, science-fiction first person shooter. The game takes place in a future where Earth has been reduced to ashes; It is now home to a new nation that hungers only for war. Prepare yourself to rise and defend against the invasion of the Forsaken.", "id": 312, "userID": "266291635715964948", "username": "Josep - CoinDreams.io", "priceUSD": 18, "price": 769.27, "version": 1, "private": null, "views": 2 }, { "_id": "5ccb421e0e90f95b56bf3915", "title": "Highway Blossoms", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/451760/header.jpg", "desc": "The gold rush has struck the west for a second time. Highway Blossoms is the story of Amber, a girl trying her best to be alone on the road until she stumbles upon a young hitchhiker and the journal of a prospector from long ago.", "id": 314, "userID": "266291635715964948", "username": "Josep - CoinDreams.io", "priceUSD": 11.5, "price": 491.48, "version": 1, "private": null, "views": 2 }, { "_id": "5ccb43120e90f95b56bf3916", "title": "Just Deserts", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/488660/header.jpg", "desc": "Just Deserts is a sci-fi action dating sim where you play as a soldier who must protect a city from mysterious alien attack, while at the same time you will also be seeking to capture the heart of your dream girl(s)!", "id": 315, "userID": "266291635715964948", "username": "Josep - CoinDreams.io", "priceUSD": 8.5, "price": 363.27, "version": 1, "private": null, "views": 2 }, { "_id": "5cd34ab655e7693538763b92", "title": "The Uncertain: Last Quiet Day", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/406970/header.jpg?t=1547210412", "desc": "The Uncertain is a story-driven adventure game set in a post-apocalyptic world. Experience the mysterious vibe of each of carefully explored locations, solve diverse puzzles, make fateful decisions and discuss intriguing matters to find out the whole truth being kept from you.", "id": 320, "userID": "547230271599280139", "username": "ZENZO Arcade", "priceUSD": 8, "price": 341.9, "version": 1, "private": null, "views": 2 }, { "_id": "5cdd971a267eb573fdf86eb5", "title": "Life is Feudal: Your Own", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/290080/header.jpg?t=1536221965", "desc": "LiF:YO places you in a realistic feudal setting with the ability to host your own private world and set your own rules to suit your playstyle. There’s an in depth crafting system, a range of building features, and free terraforming across the map - meaning you can build your own house anywhere in the world. Team up with your friends and build a village or city and repel attacks by other players who want to ransack your lands! ", "id": 321, "userID": "547230271599280139", "username": "ZENZO Arcade", "priceUSD": 12, "price": 512.85, "version": 1, "private": null, "views": 2 }, { "_id": "5cdd9b77267eb573fdf86eb8", "title": "Cities: Skylines", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/255710/header.jpg?t=1557754843", "desc": "Cities: Skylines is a modern take on the classic city simulation. The game introduces new game play elements to realize the thrill and hardships of creating and maintaining a real city whilst expanding on some well-established tropes of the city building experience.", "id": 324, "userID": "547230271599280139", "username": "ZENZO Arcade", "priceUSD": 15, "price": 641.06, "version": 1, "private": null, "views": 2 }, { "_id": "5ca4ce4ac64f2c5bdb9350c1", "title": "Killing Floor 2", "platform": "Steam", "image": "https://i.ytimg.com/vi/0mAWS8xnNuw/maxresdefault.jpg", "desc": "Killing Floor 2 is a first-person shooter video game, that can be played alone or cooperatively with up to six players. The game is based on events from Killing Floor, in which biotech firm Horzine's attempt to create military clones is hijacked by an insane researcher and unleashed on the UK. The clones have now rapidly spread across Europe, paralyzing the response from the European Union. Within Killing Floor 2, taking place a month after the first game, the outbreak has spread beyond Europe, causing governments to collapse and communication systems to fail.", "id": 141, "userID": "547230271599280139", "username": "ZENZO Arcade", "priceUSD": 8, "price": 341.9, "version": 1, "private": null, "views": 1 }, { "_id": "5ca7b79fc64f2c5bdb9350d1", "title": "Luna sky", "platform": "steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/361600/header.jpg?t=1447372225", "desc": "Momentum-driven old school platformer with modern graphics ", "id": 156, "userID": "547230271599280139", "username": "ZENZO Arcade", "priceUSD": 4, "price": 170.95, "version": 1, "private": null, "views": 1 }, { "_id": "5ca7d7f4c64f2c5bdb9350dd", "title": "The Bard's Tale", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/41900/header.jpg?t=1535045615", "desc": "You are the Bard, a selfish rogue weary of pointless sub-quests and rat-infested cellars. Through magical song you summon characters to join your quest for coin and cleavage! ", "id": 168, "userID": "547230271599280139", "username": "ZENZO Arcade", "priceUSD": 4, "price": 170.95, "version": 1, "private": null, "views": 1 }, { "_id": "5ca7d86ec64f2c5bdb9350de", "title": "Broken Sword: Director's Cut", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/57640/header.jpg?t=1485515146", "desc": "One of the all-time classic adventures, multi BAFTA-nominated \"Broken Sword: Director's Cut\" pitches sassy journalist Nico Collard, and intrepid American George Stobbart into a mysterious journey of intrigue and jeopardy.", "id": 169, "userID": "547230271599280139", "username": "ZENZO Arcade", "priceUSD": 4, "price": 170.95, "version": 1, "private": null, "views": 1 }, { "_id": "5ca7d8d8c64f2c5bdb9350df", "title": "Closure", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/72000/header.jpg?t=1477770595", "desc": "In the dark and mysterious world of Closure, only what you see exists. Manipulate lights to phase objects in and out of reality in this multiple-award-winning puzzle game. Play as a strange spider-like demon who explores the stories of three human characters through beautiful, eerie environments such as a decrepit factory, a murky forest, an abandoned carnival, and the strange, surreal realm that connects them together.", "id": 170, "userID": "547230271599280139", "username": "ZENZO Arcade", "priceUSD": 5, "price": 213.69, "version": 1, "private": null, "views": 1 }, { "_id": "5ca7da3ec64f2c5bdb9350e2", "title": "Ittle Dew", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/241320/header.jpg?t=1476720272", "desc": "Adventuress Ittle Dew and her sidekick Tippsie crash onto a strange island, filled with loot and mysterious inhabitants. It quickly dawns on the duo that this might become their biggest adventure yet.Ittle Dew boils down the classic adventure formula until there is only fun left.", "id": 173, "userID": "547230271599280139", "username": "ZENZO Arcade", "priceUSD": 7, "price": 299.16, "version": 1, "private": null, "views": 1 }, { "_id": "5ca7da97c64f2c5bdb9350e3", "title": "Frozen Synapse", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/98200/header.jpg?t=1458256347", "desc": "Frozen Synapse is the ultimate tactical game on PC and Mac.\nIt brings the simultaneous turn-based strategy genre bang up-to-date and lets you give detailed, accurate orders to your squad: classic gameplay with a modern interface.\nPlan your moves, test them out, then hit the \"Prime\" button: both you and your enemy's turns are executed simultaneously.\nCompetitive-but-intuitive multiplayer and a huge single player campaign mean that Frozen Synapse will give you hours and hours of tactical delight.", "id": 174, "userID": "547230271599280139", "username": "ZENZO Arcade", "priceUSD": 14, "price": 598.32, "version": 1, "private": null, "views": 1 }, { "_id": "5ca8a87dc64f2c5bdb9350e6", "title": "Knights of Pen and Paper  1 Edition", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/231740/header.jpg?t=1545356131", "desc": "Set out on a grand adventure in this turn-based, retro style, pixel-art RPG, inspired by the great titles of the 90's. Take on the roles of in-game players taking on the roles of their characters in a traditional pen and paper RPG session in the ultimate meta roleplaying experience.", "id": 177, "userID": "547230271599280139", "username": "ZENZO Arcade", "priceUSD": 4, "price": 170.95, "version": 1, "private": null, "views": 1 }, { "_id": "5ca8aa20c64f2c5bdb9350ea", "title": "Saints Row The Third", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/55230/header.jpg?t=1490283037", "desc": "Years after taking Stilwater for their own, the Third Street Saints have evolved from street gang to household brand name, with Saints sneakers, Saints energy drinks and Johnny Gat bobble head dolls all available at a store near you.\nThe Saints are kings of Stilwater, but their celebrity status has not gone unnoticed. The Syndicate, a legendary criminal fraternity with pawns in play all over the globe, has turned its eye on the Saints and demands tribute. Refusing to kneel to the Syndicate, you take the fight to Steelport, a once-proud metropolis reduced to a struggling city of sin under Syndicate control.", "id": 181, "userID": "547230271599280139", "username": "ZENZO Arcade", "priceUSD": 9, "price": 384.63, "version": 1, "private": null, "views": 1 }, { "_id": "5ca8aed3c64f2c5bdb9350f0", "title": "Warhammer: End Times - Vermintide", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/235540/header.jpg?t=1550502596", "desc": "Vermintide takes place in and around Ubersreik, a city overrun by Skaven. You will assume the role of one of five heroes, each featuring different play-styles, abilities, gear and personality. Working cooperatively, you must use their individual attributes to survive an apocalyptic invasion from the hordes of relentless rat-men, known as the Skaven. Battles will take place across a range of environments stretching from the top of the Magnus Tower to the bowels of the Under Empire.", "id": 187, "userID": "547230271599280139", "username": "ZENZO Arcade", "priceUSD": 15, "price": 641.06, "version": 1, "private": null, "views": 1 }, { "_id": "5caa3fe8d79ff8157ebd62b6", "title": "BUTCHER", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/474210/header.jpg?t=1537617562", "desc": "BUTCHER is a fast-paced 2D shooter and a blood-soaked love letter to the cult classics of the genre. If kicking corpses into a lava pit and adorning walls with blood is your idea of a good time, BUTCHER is THE game for you.", "id": 223, "userID": "547230271599280139", "username": "ZENZO Arcade", "priceUSD": 5, "price": 213.69, "version": 1, "private": null, "views": 1 }, { "_id": "5cabd960213eda507565d4a4", "title": "American Truck Simulator", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/270880/header.jpg", "desc": "Experience legendary American trucks and deliver various cargoes across sunny California, sandy Nevada, and the Grand Canyon State of Arizona. American Truck Simulator takes you on a journey through the breathtaking landscapes and widely recognized landmarks around the States.", "id": 232, "userID": "266291635715964948", "username": "Josep - CoinDreams.io", "priceUSD": 16, "price": 683.79, "version": 1, "private": null, "views": 1 }, { "_id": "5cabda41213eda507565d4a5", "title": "Gremlins, Inc.", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/369990/header.jpg", "desc": "This is an intense strategy board game in a steampunk world of corrupt capitalist gremlins who compete for money, political power and prestige. Save and invest, steal and extort, arrest and get arrested – in single-player and multiplayer, with ranks and ladders, team mode and spectator mode.", "id": 233, "userID": "266291635715964948", "username": "Josep - CoinDreams.io", "priceUSD": 12.5, "price": 534.21, "version": 1, "private": null, "views": 1 }, { "_id": "5cae1823518e2f0b46cae2e1", "title": "Project CARS", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/234630/header.jpg", "desc": "Project CARS is the ultimate driver journey!", "id": 247, "userID": "266291635715964948", "username": "Josep - CoinDreams.io", "priceUSD": 22.5, "price": 961.59, "version": 1, "private": null, "views": 1 }, { "_id": "5cb3513c3d55e26c2c40649b", "title": "A Winter's Daydream", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/925340/header.jpg", "desc": "A boy returns to his countryside home after spending half a year in the city, only to discover the unimaginable — his elderly grandmother has transformed into a cute young girl! Hijinks ensue.", "id": 255, "userID": "266291635715964948", "username": "Josep - CoinDreams.io", "priceUSD": 4.5, "price": 192.32, "version": 1, "private": null, "views": 1 }, { "_id": "5cb351c43d55e26c2c40649c", "title": "Empty Horizons", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/496630/header.jpg", "desc": "Following the sudden death of her father, Mireille Maiorano is sent to live with her uncle in France. Enter Lyon, a tactless, perverse Frenchman charged with escorting to Mireille to her new home. She hates him passionately, with everything she has... so why does he make her heart flutter?", "id": 256, "userID": "266291635715964948", "username": "Josep - CoinDreams.io", "priceUSD": 2, "price": 85.47, "version": 1, "private": null, "views": 1 }, { "_id": "5cb355003d55e26c2c40649f", "title": "Rubber Ducky and the Rainbow Gun", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/416550/header.jpg", "desc": "Rubber Ducky has found a Rainbow Gun during a rainstorm of colored weaponry! The Spikies love to be zapped with Rainbow Guns - so much, in fact, that they'll teleport away to tell the other Spikies about it. Follow Rubber Ducky as he spreads laser-ed goodwill in this shooter-meets-plushie-toy romp!", "id": 259, "userID": "266291635715964948", "username": "Josep - CoinDreams.io", "priceUSD": 1, "price": 42.74, "version": 1, "private": null, "views": 1 }, { "_id": "5cb359313d55e26c2c4064a5", "title": "Bakery", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/746620/header.jpg", "desc": "Operating bakery Making various breads and cakes Manage and operate storefronts", "id": 265, "userID": "266291635715964948", "username": "Josep - CoinDreams.io", "priceUSD": 6.5, "price": 277.79, "version": 1, "private": null, "views": 1 }, { "_id": "5cb925b20a4c43146ec4a71b", "title": "TWINKLE STAR SPRITES", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/366280/header.jpg", "desc": "“TWINKLE STAR SPRITES ”, a competitive 2D top-down view scrolling shooter released on NEOGEO MVS in 1996, departs for new adventures on the Steam gaming platform!Master your shots, and aim for the magical Twinkle Star”!", "id": 266, "userID": "266291635715964948", "username": "Josep - CoinDreams.io", "priceUSD": 6, "price": 256.42, "version": 1, "private": null, "views": 1 }, { "_id": "5cb927030a4c43146ec4a71d", "title": "SHOCK TROOPERS", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/366270/header.jpg", "desc": "“SHOCK TROOPERS ”, the fan favorite 2D top-down view action shooting game released exclusively on NEOGEO MVS in 1997, returns to the battlefield on Steam!Progress through the battlefield, choosing the best routes and strategy!", "id": 268, "userID": "266291635715964948", "username": "Josep - CoinDreams.io", "priceUSD": 6, "price": 256.42, "version": 1, "private": null, "views": 1 }, { "_id": "5cb928ad0a4c43146ec4a720", "title": "Bunnyrama", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/567210/header.jpg", "desc": "Bunnyrama is a puzzle adventure game where your goal is to lead the old man through the magical forest full of huge bunnies.", "id": 271, "userID": "266291635715964948", "username": "Josep - CoinDreams.io", "priceUSD": 1, "price": 42.74, "version": 1, "private": null, "views": 1 }, { "_id": "5cb929020a4c43146ec4a721", "title": "Crazy Belts", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/355510/header.jpg", "desc": "Do you know what happens after check-in? Do you think our luggage is safe in the conveyor belts of the airport? Now you can discover the truth! Crazy Belts is a casual puzzle game that tells the amazing story of our bags, and why they end up in distant countries when we leave them in the belts...", "id": 272, "userID": "266291635715964948", "username": "Josep - CoinDreams.io", "priceUSD": 3, "price": 128.21, "version": 1, "private": null, "views": 1 }, { "_id": "5cb929780a4c43146ec4a722", "title": "Obulis", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/11330/header.jpg", "desc": "Obulis can literally be learned in seconds, but the puzzles will keep you thinking for hours.", "id": 273, "userID": "266291635715964948", "username": "Josep - CoinDreams.io", "priceUSD": 4, "price": 170.95, "version": 1, "private": null, "views": 1 }, { "_id": "5cb929d50a4c43146ec4a723", "title": "Alter Army", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/602300/header.jpg", "desc": "Alter Army is a hardcore fast paced action platformer with punchy combat overflowing with game feels.Explore a dying civilization and find out what happened and why you are here collecting crystals.", "id": 274, "userID": "266291635715964948", "username": "Josep - CoinDreams.io", "priceUSD": 4, "price": 170.95, "version": 1, "private": null, "views": 1 }, { "_id": "5cba4c6d0a4c43146ec4a729", "title": "Tales from Candlekeep Tomb of Annihilation", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/663380/header.jpg", "desc": "On the deadly peninsula of Chult, an adventuring party must fight their way through dangerous jungles, labyrinths and dungeons to find and reverse the cause of the death curse. Choose to play as one or more of the four adventurers to face many perilous challenges and deadly foes throughout the quest.", "id": 277, "userID": "266291635715964948", "username": "Josep - CoinDreams.io", "priceUSD": 14, "price": 598.32, "version": 1, "private": null, "views": 1 }, { "_id": "5cba4d4f0a4c43146ec4a72b", "title": "Vertical Drop Heroes HD", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/311480/header.jpg", "desc": "Vertical Drop Heroes is a procedural platformer RPG hybrid with roguelike elements, where your hero adventures through randomly generated stages. Armed with a variety of skills and traits, you must use your cunning and reflexes to survive the dangers of each stage.", "id": 279, "userID": "266291635715964948", "username": "Josep - CoinDreams.io", "priceUSD": 5, "price": 213.69, "version": 1, "private": null, "views": 1 }, { "_id": "5cba4e630a4c43146ec4a72d", "title": "TASTEE Lethal Tactics", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/365190/header.jpg", "desc": "Strategy has a new name and it’s damn TASTEE. Recruit a team of volatile mercs and execute dramatic gunfights on a mission to take down the Cartel in this simultaneous turn-based tactics caper. Precision planning meets epic action. Regular community tournaments with prizes!", "id": 281, "userID": "266291635715964948", "username": "Josep - CoinDreams.io", "priceUSD": 13.5, "price": 576.95, "version": 1, "private": null, "views": 1 }, { "_id": "5cba4f7b0a4c43146ec4a730", "title": "Hive Jump", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/295670/header.jpg", "desc": "HIVE JUMP is a sci-fi action platformer for 1-4 players blending run ‘n gun gameplay with roguelike elements.", "id": 284, "userID": "266291635715964948", "username": "Josep - CoinDreams.io", "priceUSD": 18, "price": 769.27, "version": 1, "private": null, "views": 1 }, { "_id": "5cba515d0a4c43146ec4a732", "title": "One Finger Death Punch", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/264200/header.jpg", "desc": "Experience cinematic kung-fu battles in the fastest, most intense brawler the indie world has ever seen! With the unique 1:1 response system of One Finger Death Punch, players will feel the immediate feedback of every bone-crunching hit. Pay tribute to the masters using five classic kung-fu styles mixed ", "id": 286, "userID": "266291635715964948", "username": "Josep - CoinDreams.io", "priceUSD": 4, "price": 170.95, "version": 1, "private": null, "views": 1 }, { "_id": "5cba52cd0a4c43146ec4a734", "title": "Dex", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/269650/header.jpg", "desc": "Dex is a 2D, side-scrolling, open-world cyberpunk RPG with a focus on exploration and non-linear gameplay.", "id": 288, "userID": "266291635715964948", "username": "Josep - CoinDreams.io", "priceUSD": 17.5, "price": 747.9, "version": 1, "private": null, "views": 1 }, { "_id": "5cc63bca0890007e19d71a78", "title": " Time Recoil", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/625910/header.jpg", "desc": "Time Recoil is a top-down shooter with a slow motion twist! Punch through walls guns blazing while time slows down! See your enemies drop down like flies - and save the world from a mad scientist dictator!", "id": 291, "userID": "266291635715964948", "username": "Josep - CoinDreams.io", "priceUSD": 12, "price": 512.85, "version": 1, "private": null, "views": 1 }, { "_id": "5cc63c190890007e19d71a79", "title": "JYDGE", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/654050/header.jpg", "desc": "Build your JYDGE. Enter Edenbyrg. Get out alive. Build your own cybernetic JYDGE in this lawful-but-awful roguehate top-down shooter where you get to eradicate crime in the never-sleeping megacity of Edenbyrg.", "id": 292, "userID": "266291635715964948", "username": "Josep - CoinDreams.io", "priceUSD": 13, "price": 555.58, "version": 1, "private": null, "views": 1 }, { "_id": "5cc63d6d0890007e19d71a7d", "title": "Crimsonland", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/262830/header.jpg", "desc": "Thousands of aliens, giant spiders, mutant lizards, and more are on the attack - can you survive the onslaught? Crimsonland is a top-down shooter with a touch of RPG. Unlock over 30 weapons and over 50 perks from quirky to brutal. Complete the quest and show your skills in five survival modes.", "id": 296, "userID": "266291635715964948", "username": "Josep - CoinDreams.io", "priceUSD": 12, "price": 512.85, "version": 1, "private": null, "views": 1 }, { "_id": "5cc63deb0890007e19d71a7e", "title": "King Oddball", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/525450/header.jpg", "desc": "End the world only using your tongue and boulders! Hurl away diamonds! See tiny humans fly around against their will! Crush them all!", "id": 297, "userID": "266291635715964948", "username": "Josep - CoinDreams.io", "priceUSD": 3.5, "price": 149.58, "version": 1, "private": null, "views": 1 }, { "_id": "5ccb37d30e90f95b56bf390c", "title": "The Long Reach", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/584990/header.jpg", "desc": "At its heart The Long Reach is an adventure game. Closer inspection also reveals it’s a thrilling horror story, flavoured with sci-fi ideology, psychological context and a skeptical view on the human psyche.", "id": 305, "userID": "266291635715964948", "username": "Josep - CoinDreams.io", "priceUSD": 13, "price": 555.58, "version": 1, "private": null, "views": 1 }, { "_id": "5ccb39450e90f95b56bf390e", "title": "Coffin Dodgers", "platform": "Steam", "image": "https://steamcdn-a.akamaihd.net/steam/apps/320540/header.jpg", "desc": "Pimp up your mobility scooter and take on the Grim Reaper and his Zombie army in a race for your soul. Armed with a variety of homemade weapons and gadgets, battle your way through 13 unique ", "id": 307, "userID": "266291635715964948", "username": "Josep - CoinDreams.io", "priceUSD": 9.5, "price": 406, "version": 1, "private": null, "views": 1 }]